DataProcessors/АссистентУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>АссистентУправления</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ЗадачиАссистентаУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ЗадачиАссистентаУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВспомогательноеЗначение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодульМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиАссистентаУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОповещенияАссистентаУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>События</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СобытиеИдентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗаполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыУсловия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидСравненияЗначений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПредставление</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АссистентУправления/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если МобильныйКлиентУНФ.ФункциональностьВременноНедоступна(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	АссистентПодключен = АссистентУправления.Подключен();
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	ТекущийЭлемент = Элементы.ИзмениСостояниеПриОплате;
	ТекущаяСтраница = "ИзмениСостояниеЗаказа";

	ИспользоватьПодсистемуПроизводство = ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуПроизводство");
	ИспользоватьБонусныеПрограммы = ПолучитьФункциональнуюОпцию("ИспользоватьБонусныеПрограммы");
	ИспользоватьОтчетность = ПолучитьФункциональнуюОпцию("ИспользоватьОтчетность");
	ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи = ПолучитьФункциональнуюОпцию("ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи");
	ПланироватьЗагрузкуРесурсовПредприятияРаботы  = ПолучитьФункциональнуюОпцию("ПланироватьЗагрузкуРесурсовПредприятияРаботы");
	УчетПотребностиПоСкладам = ПолучитьФункциональнуюОпцию("УчетПотребностиПоСкладам");
	ИспользоватьРегулярныеПлатежи = ПолучитьФункциональнуюОпцию("ИспользоватьРегулярныеПлатежи");
	ИспользоватьПодсистемуCRM = ПолучитьФункциональнуюОпцию( "ИспользоватьПодсистемуCRM" );
	ИспользоватьПодсистемуЗакупки = ПолучитьФункциональнуюОпцию( "ИспользоватьПодсистемуЗакупки" );
	ИспользоватьАнализБизнеса = ПолучитьФункциональнуюОпцию( "ИспользоватьАнализБизнеса" );
	
	УстановитьПризнакиВРаботе();
	
	УстановитьВидимостьЭлементов();
	
	УправлениеФормой();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзмениСостояниеПриОплате(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОплате");
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеПриОплатеИОтгрузке(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОплатеИОтгрузке");
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеПриОтгрузке(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ИзменениеСостоянияЗаказаПриОтгрузке");
КонецПроцедуры

&НаКлиенте
Процедура СообщиПриОплатеЗаказа(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяПриОплатеЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура СообщиПриОтгрузкеЗаказа(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяПриОтгрузкеЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура СообщиПриОтгрузкеИОплате(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяПриОтгрузкеИОплатеЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПокупателяПоЗаказамПоставщикам(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикам";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПокупателяПоЗаказамНаПроизводство(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаПоставщикуПриОплате(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриОплате";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаПоставщикуПриПоставке(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриПоставке";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаПоставщикуПриОплатеИПоставке(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПриОплатеИПоставке";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриОплатеЗаказаПоставщику(Команда)
	
	ИдентификаторГруппы = "ОповещениеПользователюПриОплатеЗаказаПоставщику";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриПоставкеЗаказаПоставщику(Команда)
	
	ИдентификаторГруппы = "ОповещениеПользователюПриПоставкеЗаказаПоставщику";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриОплатеИПоставкеЗаказаПоставщику(Команда)
	
	ИдентификаторГруппы = "ОповещениеПользователюПриОплатеИПоставкеЗаказаПоставщику";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПриОплатеИПоставке", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПокупателяПоЗаказамПоставщикамНаПроизводство(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПокупателяПоЗаказамПоставщикам(Команда)
	
	ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовПоставщикам";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПокупателяПоЗаказамНаПроизводство(Команда)
	
	ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПокупателяПоЗаказамПоставщикамИНаПроизводство(Команда)
	
	ИдентификаторГруппы = "ОповещениеЗаказуПокупателяПоСостояниюЗаказовПоставщикамИНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПокупателяПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказПоставщикуПоЗаказамПокупателей(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаПоставщикуПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуПоставщикуПоЗаказамПокупателей(Команда)
	
	ИдентификаторГруппы = "ОповещениеЗаказаПоставщикуПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомПоставщикуПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаНаПроизводствоПриВыполнении(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаНаПроизводствоПриВыполнении";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПриВыполнении", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказаНаПроизводствоПоЗаказуПокупателя(Команда)
	
	ИдентификаторГруппы = "ИзменениеСостоянияЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяПриВыполненииЗаказаНаПроизводство(Команда)
	
	ИдентификаторГруппы = "ОповещениеПользователюПриВыполненииЗаказаНаПроизводство";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПриВыполнении", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщиЗаказуНаПроизводствоПоЗаказамПокупателей(Команда)
	
	ИдентификаторГруппы = "ОповещениеЗаказаНаПроизводствоПоСостояниюЗаказовПокупателей";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ДействияСЗаказомНаПроизводствоПоСостояниюСвязанныхЗаказов", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОБонусахПриУсловиях(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаОБонусахПриУсловиях");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОБонусахПриПродаже(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаОБонусахПриПродаже");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиСотрудникаОбИзмененииБонусовПриПродаже(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииНачисленияСписанияБаллов");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОбИзмененииСостоянияЗаказа(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаОбИзмененииСостоянияЗаказа");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОНачисленныхНалогах(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.РасчетИОповещениеПользователяОНачисленныхНалогах");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОбОтчетности(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ФормированиеИОповещениеПользователяОНеобходимостиСдачиОтчетности");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиентаОЗаписиНаУслугу(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеКлиентаНаВсехЭтапахЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиОбИзмененииСостоянияЗаказаПокупателя(Команда)
	
	ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииСостоянияЗаказаПокупателя";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииСостоянияЗП", ИдентификаторГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщиПользователюПриИзмененииОтветственного(Команда)
	
	ИдентификаторГруппы = "ОповещениеПользователяОбИзмененииОтветственногоЗаказПокупателя";
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииОтветственного");
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиОМинимальномУровнеОстатков(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбОстатках");
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователяОбИзмененииПоказателя(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОбИзмененииПоказателя");
КонецПроцедуры

&НаКлиенте
Процедура РегулярноОповещайПользователяОПоказателе(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОПоказателе");
КонецПроцедуры

&НаКлиенте
Процедура РегулярноОповещайПользователяОРегулярномПлатеже(Команда)
	ОткрытьФормуЗадачи("Обработка.АссистентУправления.Форма.ОповещениеПользователяОРегулярномПлатеже");
КонецПроцедуры

&НаКлиенте
Процедура ИзмениСостояниеЗаказа(Команда)
	
	ТекущаяСтраница = "ИзмениСостояниеЗаказа";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Истина;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = Новый Цвет(252,231,81);
	Элементы.ОповестиПользователя.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиКлиента.ЦветФона = Новый Цвет(255,255,255);
	Элементы.РекомендацииОтДаши.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиСНалогами.ЦветФона = Новый Цвет(255,255,255); 
	Элементы.ПомогиКонтролировать.ЦветФона = Новый Цвет(255,255,255);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиПользователя(Команда)
	ТекущаяСтраница = "ОповестиПользователя";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Истина;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;

	Элементы.ИзмениСостояниеЗаказа.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиПользователя.ЦветФона = Новый Цвет(252,231,81);
	Элементы.ОповестиКлиента.ЦветФона = Новый Цвет(255,255,255);
	Элементы.РекомендацииОтДаши.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиСНалогами.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиКонтролировать.ЦветФона = Новый Цвет(255,255,255);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповестиКлиента(Команда)
	ТекущаяСтраница = "ОповестиКлиента";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Истина;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиПользователя.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиКлиента.ЦветФона = Новый Цвет(252,231,81);
	Элементы.РекомендацииОтДаши.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиСНалогами.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиКонтролировать.ЦветФона = Новый Цвет(255,255,255);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомогиСНалогами(Команда)
	
	ТекущаяСтраница = "ПомогиСНалогами";
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Истина;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиПользователя.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиКлиента.ЦветФона = Новый Цвет(255,255,255);
	Элементы.РекомендацииОтДаши.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиСНалогами.ЦветФона = Новый Цвет(252,231,81);
	Элементы.ПомогиКонтролировать.ЦветФона = Новый Цвет(255,255,255);
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииОтДаши(Команда)
	
	ТекущаяСтраница = "РекомендацииДаши";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Истина;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Ложь;

	Элементы.ИзмениСостояниеЗаказа.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиПользователя.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиКлиента.ЦветФона = Новый Цвет(255,255,255);
	Элементы.РекомендацииОтДаши.ЦветФона = Новый Цвет(252,231,81);
	Элементы.ПомогиСНалогами.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиКонтролировать.ЦветФона = Новый Цвет(255,255,255);

КонецПроцедуры

&НаКлиенте
Процедура ПомогиКонтролировать(Команда)
	
	ТекущаяСтраница = "ПомогиКонтролировать";
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = Ложь;
	Элементы.Группа_ОповещениеПользователя.Видимость = Ложь;
	Элементы.Группа_ОповещениеКлиента.Видимость = Ложь;
	Элементы.Группа_РекомендацииДаши.Видимость = Ложь;
	Элементы.Группа_ОповещениеОНалогах.Видимость = Ложь;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = Истина;
	
	Элементы.ИзмениСостояниеЗаказа.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиПользователя.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ОповестиКлиента.ЦветФона = Новый Цвет(255,255,255);
	Элементы.РекомендацииОтДаши.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиСНалогами.ЦветФона = Новый Цвет(255,255,255);
	Элементы.ПомогиКонтролировать.ЦветФона = Новый Цвет(252,231,81);

	
КонецПроцедуры

&НаКлиенте
Процедура КурсОперУправление(Команда)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("http://1c.ru/rus/partners/training/uc1/course.jsp?id=286");
КонецПроцедуры

&НаКлиенте
Процедура ЭкзаменСпециалист(Команда)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("http://1c.ru/rus/partners/training/uc1/course.jsp?id=657");
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВыполненияЗадач(Команда)
	
	ОткрытьФорму("РегистрСведений.ВыполненныеЗадачиАссистентаУправления.Форма.ВыполненныеЗадачи");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодключитьОбсужденияНажатие(Элемент)
	НачатьПодключениеОбсуждений();
КонецПроцедуры

&НаКлиенте
Процедура ТекстОшибкиПодключениеНажатие(Элемент)
	ПодключитьАссистента();
КонецПроцедуры

&НаКлиенте
Процедура ТекстОшибкиОбсуждениеНажатие(Элемент)
	СоздатьОбсуждение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключитьАссистента()
	
	Если АссистентПодключен Тогда
		Возврат;
	КонецЕсли;

	ПодключитьАссистентаНаСервере();
	АссистентУправленияКлиент.Подключить();
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьАссистентаНаСервере()
	
	Если АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	АссистентУправления.Подключить();
	
	АссистентПодключен = АссистентУправления.Подключен();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиВРаботе(ИдентификаторГруппы = Неопределено)
	
	ОтборПоГруппе = Ложь;
	
	Если ИдентификаторГруппы = Неопределено Тогда
		ОтборПоГруппе = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиАссистента.Родитель КАК Родитель,
	|	ЗадачиАссистента.Используется КАК Используется
	|ПОМЕСТИТЬ ИспользуемыеГруппыЗадач
	|ИЗ
	|	Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистента
	|ГДЕ
	|	ЗадачиАссистента.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадачиАссистента.Родитель,
	|	ЗадачиАссистента.Используется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиАссистента.ИдентификаторГруппы КАК ИдентификаторГруппы,
	|	ИспользуемыеГруппыЗадач.Используется КАК Используется
	|ИЗ
	|	ИспользуемыеГруппыЗадач КАК ИспользуемыеГруппыЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистента
	|		ПО ИспользуемыеГруппыЗадач.Родитель = ЗадачиАссистента.Ссылка
	|ГДЕ
	|	(&ОтборПоГруппе
	|			ИЛИ ЗадачиАссистента.ИдентификаторГруппы = &ИдентификаторГруппы)";
	
	Запрос.УстановитьПараметр("ОтборПоГруппе", ОтборПоГруппе);
	Запрос.УстановитьПараметр("ИдентификаторГруппы", ИдентификаторГруппы);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ЭлементВРаботе = Элементы.Найти("ВРаботе_"+Выборка.ИдентификаторГруппы);
		
		Если ЭлементВРаботе = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементВРаботе.Видимость = Выборка.Используется;
		
	КонецЦикла;
	
	УстановитьПризнакиВРаботеЗадачПоНалогам(ОтборПоГруппе, ИдентификаторГруппы);
	Элементы.ВРаботе_ОповещениеКлиентаОЗаписиНаУслугу.Видимость =
		Справочники.ЗадачиАссистентаПоНапоминаниямОЗаписи.ЕстьЗадачиВРаботе();
	Элементы.ВРаботе_ОповещениеПользователяОМинимальномУровнеОстатков.Видимость =
		Справочники.ЗадачиАссистентаПоРаботеСОстатками.ЕстьЗадачиВРаботе();
	Элементы.ВРаботе_ОповещениеПользователяОПоказателе.Видимость = 
		Справочники.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ЕстьЗадачиВРаботе(Истина);
	Элементы.ВРаботе_ОповещениеПользователяОбИзмененииПоказателя.Видимость = 
		Справочники.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ЕстьЗадачиВРаботе(Ложь);
	Элементы.ВРаботе_ОповещениеПользователяОРегулярномПлатеже.Видимость = 
		Справочники.ЗадачиАссистентаПоРегулярнымПлатежам.ЕстьЗадачиВРаботе();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиВРаботеЗадачПоНалогам(ОтборПоГруппе, ИдентификаторГруппы) 
	
	Если (ИдентификаторГруппы <> "РасчетИОповещениеПользователяОНачисленныхНалогах"
		И ИдентификаторГруппы <> "ФормированиеИОповещениеПользователяОНеобходимостиСдачиОтчетности") И НЕ ОтборПоГруппе Тогда
		Возврат;
	КонецЕсли;
	
	ВключенныеЗадачиНалогов = Справочники.ЗадачиАссистентаПоРасчетуНалогов.ИдентификаторыВключенныхЗадач();
	
	Если ВключенныеЗадачиНалогов.Найти(ИдентификаторГруппы) = Неопределено Тогда
		
		ЭлементВРаботе = Элементы.Найти("ВРаботе_"+ИдентификаторГруппы);
		
		Если ЭлементВРаботе <> Неопределено Тогда
			ЭлементВРаботе.Видимость = Ложь;
		КонецЕсли;

	КонецЕсли;
	
	Для Каждого ИдентификаторЗадачи Из ВключенныеЗадачиНалогов Цикл 
		
		ЭлементВРаботе = Элементы.Найти("ВРаботе_"+ИдентификаторЗадачи);
		
		Если ЭлементВРаботе = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементВРаботе.Видимость = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеОбсуждений()
	
	Продолжение = Новый ОписаниеОповещения("ЗавершитьПодключениеОбсуждений", ЭтотОбъект);
	ОбсужденияКлиент.ПоказатьПодключение(Продолжение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодключениеОбсуждений(Результат, ДополнительныеПараметры) Экспорт
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	// Даша, измени состояние заказа…
	Элементы.ИзмениСостояниеЗаказа.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказаПокупателя.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияЗаказаПокупателяОплатаОтгрузка.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияОплатаЗаказПокупателя.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияОтгрузка.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияОплатаИОтгрузка.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ИзменениеСостоянияЗаказаПокупателяСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказПокупателяЗаказПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказПокупателяЗаказНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказыПокупателяЗаказПоставщикуИНаПроизводство.Видимость = ИспользоватьПодсистемуЗакупки И ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказаПоставщикуОплатаПоставка.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияОплатаЗаказПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияПоставка.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказаПоставщикуСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияОплатаИПоставка.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказПоставщикуЗаказПокупателя.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ИзменениеСостоянияЗаказаНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказаНаПроизводствоВыполнение.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияВыполнениеЗаказНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ИзменениеСостоянияЗаказНаПроизводствоЗаказПокупателя.Видимость = ИспользоватьПодсистемуПроизводство;

	// Даша, оповести сотрудника...
	Элементы.ОповестиПользователя.Видимость = ИСТИНА;
	Элементы.Группа_ОповещениеПользователя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяОСтатусеЗаказаПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеЗаказПокупателяПриОплатеОтгрузке.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеПользователяПриОплатеЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеПользователяПриОтгрузкеЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеПользователяПриОтгрузкеОплатеЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ОповещениеЗаказаПокупателяСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказаПокупателяПоЗаказамПоставщикам.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказаПокупателяПоЗаказамНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказаПокупателяПоЗаказамПоставщикамИНаПроизводство.Видимость = ИспользоватьПодсистемуЗакупки И ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеПользователяИзменениеРеквизитовЗаказаПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяИзменениеСостоянияЗаказаПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяИзменениеОтветственногоЗаказПокупателя.Видимость = ИСТИНА;
	Элементы.ОповещениеПользователяОСтатусеЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказПокупателяПриОплатеИПоставке.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяПриОплатеЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяПриПоставкеЗаказаПоставщику.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказаПоставщикуСвязанныеЗаказы.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяПриОплатеИПоставкеЗаказа.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеЗаказаПоставщикуПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ОповещениеПользователяОСтатусеЗаказаНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказНаПроизводствоВыполнение.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеПользователяПриВыполненииЗаказаНаПроизводство.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеЗаказаНаПроизводствоПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОповещениеПользователяОбИзмененииБонусов.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ГруппаИзменениеНачисленияСписанияБонусов.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеПользователяОбИзмененииБонусовПриПродаже.Видимость = ИспользоватьБонусныеПрограммы;

	// Даша, оповести клиента...
	Элементы.ОповестиКлиента.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьБонусныеПрограммы ИЛИ ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.Группа_ОповещениеКлиента.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьБонусныеПрограммы ИЛИ ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.ОповещениеКлиентаОБонусах.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ГруппаОповещениеКлиентаОБонусах.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеКлиентаОБонусахПриПродаже.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеКлиентаОБонусахПриУсловиях.Видимость = ИспользоватьБонусныеПрограммы;
	Элементы.ОповещениеКлиентаОЗаписиНаУслугу.Видимость =  ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.ГруппаОповещениеКлиентаОЗаписиНаУслугу.Видимость =  ПланироватьЗагрузкуРесурсовПредприятияЖурналЗаписи ИЛИ ПланироватьЗагрузкуРесурсовПредприятияРаботы;
	Элементы.ОповещениеКлиентаОбИзмененииСостоянияЗаказа.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.ГруппаОповещениеКлиентаОбИзмененииСостояния.Видимость = ИспользоватьПодсистемуCRM;

	// Даша, помоги с налогами...
	Элементы.ПомогиСНалогами.Видимость = ИспользоватьОтчетность;
	Элементы.Группа_ОповещениеОНалогах.Видимость = ИспользоватьОтчетность;
	Элементы.ГруппаОповещениеКлиентаОНалогах.Видимость = ИспользоватьОтчетность;
	Элементы.ОповещениеКлиентаОНачисленныхНалогах.Видимость = ИспользоватьОтчетность;
	Элементы.ОповещениеКлиентаОбОтчетности.Видимость = ИспользоватьОтчетность;

	// Даша, помоги контролировать...
	Элементы.ПомогиКонтролировать.Видимость = УчетПотребностиПоСкладам ИЛИ ИспользоватьАнализБизнеса ИЛИ ИспользоватьРегулярныеПлатежи;
	Элементы.Группа_ОповещениеОБизнесе.Видимость = УчетПотребностиПоСкладам ИЛИ ИспользоватьАнализБизнеса ИЛИ ИспользоватьРегулярныеПлатежи;
	Элементы.ОповещениеПользователяОМинимальномУровнеОстатков.Видимость = УчетПотребностиПоСкладам;
	Элементы.ОповещениеМинимальномУровеньОстатков.Видимость = УчетПотребностиПоСкладам;
	Элементы.ОповещениеОСостоянииКомпании.Видимость = ИспользоватьАнализБизнеса;
	Элементы.ГруппаОповещениеОСостоянииКомпании.Видимость = ИспользоватьАнализБизнеса;
	Элементы.ОповещениеПользователяОбИзмененииПоказателяБизнеса.Видимость = ИспользоватьАнализБизнеса;
	Элементы.РегулярноеОповещениеПользователяОПоказателеБизнеса.Видимость = ИспользоватьАнализБизнеса;
	Элементы.ГруппаОповещениеОРегулярныхПлатежах.Видимость = ИспользоватьРегулярныеПлатежи;
	Элементы.РегулярноеОповещениеПользователяОРегулярномПлатеже.Видимость = ИспользоватьРегулярныеПлатежи;

	// Рекомендации Даши
	Элементы.РекомендацииОтДаши.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.Группа_РекомендацииДаши.Видимость = ИспользоватьПодсистемуCRM ИЛИ ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.ОплатаОтгрузкаПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа31.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа29.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа32.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа33.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа30.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.ПроизводствоПоЗаказуПокупателя.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.Группа25.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.Группа26.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОтменаПроизводстваИлиПоставки.Видимость = ИспользоватьПодсистемуЗакупки ИЛИ ИспользоватьПодсистемуПроизводство;
	Элементы.Группа36.Видимость = ИспользоватьПодсистемуЗакупки;
	Элементы.Группа44.Видимость = ИспользоватьПодсистемуПроизводство;
	Элементы.ОплатаОтгрузкаПоЗаказуПокупателяКлиент.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа35.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа37.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа38.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа39.Видимость = ИспользоватьПодсистемуCRM;
	Элементы.Группа40.Видимость = ИспользоватьПодсистемуCRM;
   
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	РазрешеноИзменятьЗадачи = Обработки.АссистентУправления.РазрешеноИзменятьЗадачи();
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	Элементы.ИмяОбсуждения.Видимость = ИнформационнаяБазаПодключена ИЛИ НЕ РазрешеноИзменятьЗадачи;
	Элементы.ПодключитьОбсуждения.Видимость = НЕ ИнформационнаяБазаПодключена И РазрешеноИзменятьЗадачи;
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	ЕстьОшибкиПодключения = ЕстьОшибкиПодключения();
	ЕстьОшибкиСозданияОбсуждения = ЕстьОшибкиСозданияОбсуждения();
	
	Элементы.ПанельОшибки.Видимость = (ЕстьОшибкиПодключения ИЛИ ЕстьОшибкиСозданияОбсуждения) И РазрешеноИзменятьЗадачи;
	Элементы.ОшибкаОбсуждения.Видимость  = ЕстьОшибкиСозданияОбсуждения И НЕ ЕстьОшибкиПодключения И РазрешеноИзменятьЗадачи;
	Элементы.ОшибкаПодключения.Видимость = ЕстьОшибкиПодключения И РазрешеноИзменятьЗадачи;
	
	Элементы.Группа_ИзменениеСостоянияЗаказа.Видимость = ТекущаяСтраница = "ИзмениСостояниеЗаказа";
	Элементы.Группа_ОповещениеПользователя.Видимость   = ТекущаяСтраница = "ОповестиПользователя";
	Элементы.Группа_ОповещениеКлиента.Видимость        = ТекущаяСтраница = "ОповестиКлиента";
	Элементы.Группа_РекомендацииДаши.Видимость         = ТекущаяСтраница = "РекомендацииДаши";
	Элементы.Группа_ОповещениеОНалогах.Видимость       = ТекущаяСтраница = "ПомогиСНалогами";
	Элементы.Группа_ОповещениеОБизнесе.Видимость       = ТекущаяСтраница = "ПомогиКонтролировать";

	РазмерыЭкрана = ПолучитьИнформациюЭкрановКлиента();
	
	Если РазмерыЭкрана = Неопределено ИЛИ (ТипЗнч(РазмерыЭкрана) = Тип("ФиксированныйМассив") И РазмерыЭкрана.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ШиринаЭкрана = 1280;
	ВысотаЭкрана = 1024;
	
	Если РазмерыЭкрана[0].Ширина > ШиринаЭкрана И РазмерыЭкрана[0].Высота > ВысотаЭкрана Тогда
		Элементы.Переместить(Элементы.ОповестиКлиента, Элементы.Строка_1);
	Иначе
		Элементы.Переместить(Элементы.ОповестиКлиента, Элементы.Строка_2, Элементы.ПомогиСНалогами);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбсуждение()
	
	Если АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АссистентУправления.СоздатьОбсуждениеЖурналРаботыАссистента();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗадачи(ИмяФормы, ИдентификаторГруппы = "")
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗадачи",ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторГруппы", ИдентификаторГруппы);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы ,,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗадачи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьЗакрытиеФормыЗадачиСервер(Результат);
	
	Если НЕ ИнформационнаяБазаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьАссистента();
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьЗакрытиеФормыЗадачиСервер(Результат)
	
	ИнформационнаяБазаПодключена = СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ИзмененПризнакВРаботе Тогда
		УстановитьПризнакиВРаботе(Результат.ГруппаЗадач);
		ОпределитьИспользованиеЗадачАссистентаУправления();
	КонецЕсли;
	
	Если НЕ ИнформационнаяБазаПодключена Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ АссистентПодключен Тогда
		Возврат;
	КонецЕсли;
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	
	Если НЕ ОбсуждениеСоздано Тогда
		Попытка
			СоздатьОбсуждение();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	УправлениеФормой();
	
	Если ЗначениеЗаполнено(Результат.АвторИзменений) И Результат.НужноДобавитьВОбсуждение Тогда
		Попытка
			АссистентУправления.ОбновитьУчастниковЖурналРаботыАссистента(Результат.АвторИзменений);
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьОшибкиПодключения()
	
	Возврат НЕ АссистентУправления.Подключен() И ПолучитьФункциональнуюОпцию("ИспользованиеЗадачАссистентаУправления");
	
КонецФункции

&НаСервере
Функция ЕстьОшибкиСозданияОбсуждения()
	
	ОбсуждениеСоздано = АссистентУправления.ПолучитьОбсуждениеЖурналРаботыАссистента() <> Неопределено;
	
	Возврат НЕ ОбсуждениеСоздано И ПолучитьФункциональнуюОпцию("ИспользованиеЗадачАссистентаУправления");
	
КонецФункции

&НаСервере
Процедура ОпределитьИспользованиеЗадачАссистентаУправления()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиАссистентаУправления.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЗадачиАссистентаУправления КАК ЗадачиАссистентаУправления
	|ГДЕ
	|	НЕ ЗадачиАссистентаУправления.ПометкаУдаления
	|	И ЗадачиАссистентаУправления.Используется
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.Ссылка
	|ИЗ
	|	Справочник.ЗадачиАссистентаПоРаботеСПоказателямиБизнеса КАК ЗадачиАссистентаПоРаботеСПоказателямиБизнеса
	|ГДЕ
	|	НЕ ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.ПометкаУдаления
	|	И ЗадачиАссистентаПоРаботеСПоказателямиБизнеса.Используется";
	
	Константы.ИспользованиеЗадачАссистентаУправления.Установить(Запрос.Выполнить().Выбрать().Количество() <> 0);
	
КонецПроцедуры
	
#Область БольшеВозможностей

&НаКлиенте
Процедура ПредложитьВозможностьНажатие(Элемент)
	
	ТекстПисьма = НСтр("ru = 'Опишите, каких навыков не хватает ассистенту управления:'");
	Тег = НСтр("ru = 'Ассистент управления'");
	
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, ТекстПисьма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
